Repository: HVL-ML/docs
Catalog: po/*.po
Languages: nb

source: Summary
nb: Sammendrag

source: Introduction
nb: Introduksjon

source: Getting Started
nb: Kom i gang

source: Welcome to the internal documentation for the Artificial Intelligence (AI) group at HVL. This comprehensive guide is designed to provide our team members with essential information about accessing and utilizing various Large Language Model (LLM) services within our organization.
nb: Velkommen til den interne dokumentasjonen for Artificial Intelligence (AI)-gruppen ved HVL. Denne omfattende guiden er utformet for å gi våre teammedlemmer essensiell informasjon om tilgang til og bruk av ulike Large Language Model (LLM)-tjenester innenfor vår organisasjon.

source: Purpose of This Documentation
nb: Formålet med denne dokumentasjonen

source: The primary objectives of this documentation are to:
nb: Hovedmålene med denne dokumentasjonen er å:

source: Streamline access to LLM services
nb: Effektivisere tilgangen til LLM-tjenester

source: Provide clarity on deployment locations and configurations
nb: Gi klarhet om distribusjonssteder og konfigurasjoner

source: Ensure consistent usage across projects and teams
nb: Sikre konsistent bruk på tvers av prosjekter og team

source: Facilitate onboarding of new team members
nb: Lette onboarding av nye teammedlemmer

source: Serve as a reference for best practices and troubleshooting
nb: Fungere som en referanse for beste praksis og feilsøking

source: What You'll Find Here
nb: Hva du finner her

source: This documentation covers:
nb: Denne dokumentasjonen dekker:

source: Detailed instructions for accessing different LLM services
nb: Detaljerte instruksjoner for tilgang til ulike LLM-tjenester

source: Information on deployment environments (e.g., cloud, on-premises)
nb: Informasjon om distribusjonsmiljøer (f.eks. sky, på stedet)

source: Configuration guidelines and best practices
nb: Retningslinjer for konfigurasjon og beste praksis

source: Authentication and security protocols
nb: Autentiserings- og sikkerhetsprotokoll

source: API documentation and usage examples
nb: API-dokumentasjon og brukseksempler

source: Troubleshooting tips and known issues
nb: Tips for feilsøking og kjente problemer

source: We encourage all team members to familiarize themselves with this documentation and to contribute to its ongoing improvement. If you notice any discrepancies or have suggestions for additions, please don't hesitate to reach out to the documentation maintenance team.
nb: Vi oppfordrer alle teammedlemmer til å gjøre seg kjent med denne dokumentasjonen og til å bidra til dens kontinuerlige forbedring. Hvis du oppdager uoverensstemmelser eller har forslag til tilføyelser, ikke nøl med å ta kontakt med dokumentasjonsvedlikeholdsteamet.

source: Let's leverage our collective knowledge to drive innovation and excellence in AI at HVL!
nb: La oss utnytte vår kollektive kunnskap for å drive innovasjon og fremragenhet innen AI ved HVL!

source: Avaliable Models for testing on HVL Azure cloud
nb: Modeller som kan testes på HVL Azure-skyen

source: Note that you will need a key to access these APIs. You can aquire a key by contact an admin.
nb: Merk at du trenger en nøkkel for å få tilgang til disse API-ene. Du kan skaffe deg en nøkkel ved å kontakte en administrator.

source: The Meta Llama 3.1 collection of multilingual large language models (LLMs) is a collection of pretrained and instruction tuned generative models in 8B, 70B and 405B sizes (text in/text out). The Llama 3.1 instruction tuned text only models (8B, 70B, 405B) are optimized for multilingual dialogue use cases and outperform many of the available open source and closed chat models on common industry benchmarks.[1](https://huggingface.co/meta-llama/Meta-Llama-3.1-405B-Instruct)
nb: Meta Llama 3.1-samlingen av flerspråklige store språkmodeller (LLM-er) er en samling av forhåndstrenede og instruksjonsinnstilte generative modeller i størrelsene 8B, 70B og 405B (tekst inn/tekst ut). Llama 3.1-instruksjonsjusterte tekstmodeller (8B, 70B, 405B) er optimalisert for flerspråklige dialoger og utkonkurrerer mange av de tilgjengelige åpne kildekodemodellene og lukkede chat-modellene på vanlige bransjereferanser[1](https://huggingface.co/meta-llama/Meta-Llama-3.1-405B-Instruct)

source: Meta Llama 3.1 is deployed and accessible at this address:
nb: Meta Llama 3.1 er distribuert og tilgjengelig på denne adressen:

source: You can access the completions api here: [/chat/completions](https://Meta-Llama-3-1-405B-Instruct-nvn.eastus2.models.ai.azure.com/chat/completions) or alternatively here: [/v1/chat/completions](https://Meta-Llama-3-1-405B-Instruct-nvn.eastus2.models.ai.azure.com/)
nb: Du kan få tilgang til fullførings-APIet her: [/chat/completions](https://Meta-Llama-3-1-405B-Instruct-nvn.eastus2.models.ai.azure.com/chat/completions) eller alternativt her: [/v1/chat/completions](https://Meta-Llama-3-1-405B-Instruct-nvn.eastus2.models.ai.azure.com/)

source: [pricing](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/metagenai.meta-llama-3-1-405b-instruct-offer?tab=PlansAndPrice):
nb: [pris](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/metagenai.meta-llama-3-1-405b-instruct-offer?tab=PlansAndPrice):

source: Input Tokens: $0.00533 per 1000 tokens Output Tokens: $0.016 per 1000 tokens Cost per 1m I/O tokens: $21.3
nb: Input tokens: $0,00533 per 1000 tokens Output tokens: $0,016 per 1000 tokens Kostnad per 1m I/O tokens: $21,3

source: You can access the completions api here: [/chat/completions](https://Mistral-large-2407-kfedo.eastus2.models.ai.azure.com/chat/completions) or alternatively here: [/v1/chat/completions](https://Mistral-large-2407-kfedo.eastus2.models.ai.azure.com/v1/chat/completions)
nb: Du kan få tilgang til fullførings-APIet her: [/chat/completions](https://Mistral-large-2407-kfedo.eastus2.models.ai.azure.com/chat/completions) eller alternativt her: [/v1/chat/completions](https://Mistral-large-2407-kfedo.eastus2.models.ai.azure.com/v1/chat/completions)

source: [pricing](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/000-000.mistral-ai-large-2407-offer?tab=PlansAndPrice):
nb: [pris](https://azuremarketplace.microsoft.com/en-us/marketplace/apps/000-000.mistral-ai-large-2407-offer?tab=PlansAndPrice):

source: Input Tokens: $0.009 per 1000 tokens Output Tokens: $0.003 per 1000 tokens Cost per 1m I/O tokens: $11
nb: Input tokens: $0,009 per 1000 tokens Output tokens: $0,003 per 1000 tokens Kostnad per 1m I/O tokens: $11

source: Getting started with hugging chat
nb: Kom i gang med Hugging Chat

source: Clone the repo and install using npm, pnpm or bun:
nb: Klon repoen og installer med npm, pnpm eller bun:

source: Make sure a mongodb instance is running:
nb: Sørg for at en mongodb-instans kjører:

source: Create an .env.local in the root with the following information (Make sure to replace `YOUR_API_KEY` with a real key):
nb: Opprett en .env.local i roten med følgende informasjon (sørg for å erstatte `YOUR_API_KEY` med en ekte nøkkel):
